app/controllers/api/v1/products_controller.rb

      def create
        product = current_user.products.build(product_params)
        if product.save
---
INSERT INTO "products" ("title", "price", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

      def update
        product = current_user.products.find(params[:id])
        if product.update(product_params)
---
SELECT  "products".* FROM "products" WHERE "products"."user_id" = $1 AND "products"."id" = $2 LIMIT $3  [["user_id", 622], ["id", 275], ["LIMIT", 1]]
UPDATE "products" SET "title" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["title", "An expensive TV"], ["updated_at", 2016-11-15 21:15:50 UTC], ["id", 332]]

      def destroy
        product = current_user.products.find(params[:id])
        product.destroy
---
SELECT  "products".* FROM "products" WHERE "products"."user_id" = $1 AND "products"."id" = $2 LIMIT $3  [["user_id", 831], ["id", 420], ["LIMIT", 1]]
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 420]]

      def find_product
        Product.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]