app/controllers/api/v1/sessions_controller.rb

      def create

        user = User.find_by(email: session_params[:email])


        if user && user.valid_password?(session_params[:password])
          sign_in user, store: false
          user.generate_auth_token!
          user.save
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "rocio@riceroberts.info"], ["LIMIT", 1]]
UPDATE "users" SET "current_sign_in_at" = ?, "last_sign_in_at" = ?, "current_sign_in_ip" = ?, "last_sign_in_ip" = ?, "sign_in_count" = ?, "updated_at" = ? WHERE "users"."id" = ?

      def destroy
        current_user.generate_auth_token!
        current_user.save
---
UPDATE "users" SET "auth_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["auth_token", "s_Sf9GZNtveXV6NPKy1V"], ["updated_at", 2016-11-09 00:51:10 UTC], ["id", 173]]