app/controllers/api/v1/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      def show
        respond_with User.find(params[:id])

INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "auth_token") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
      def create
        user = User.new(user_params)
        if user.save

UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "novoemail@mail.com"], ["updated_at", 2016-10-22 22:37:42 UTC], ["id", 1]]
---
      def update
        user = find_user

        if user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
---
      def destroy
        user = find_user
        user.destroy

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      def find_user
        User.find(params[:id])